app/controllers/secret_santa_controller.rb

  def webhook
    Rails.logger.info(params)

    if should_create_secret_santa_event?
      event = SecretSantaEvent.new
      event.id_chat = normalized_params[:id_chat]
      event.title = normalized_params[:chat_title]
      event.save
    end

    if commands.has_key?(normalized_params[:message_text])
      send(commands[normalized_params[:message_text]])
    elsif create_wish_list?
      participant = get_participant_by_id_telegram(
        normalized_params[:participant_telegram_id],
        normalized_params[:id_chat]
      )

      Participant.update(participant.id, wish_list: normalized_params[:message_text])
---
INSERT INTO "secret_santa_events" ("id_chat", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_chat", -91778036], ["title", "grupo do amigo oculto fake"], ["created_at", "2015-12-24 03:38:08.471056"], ["updated_at", "2015-12-24 03:38:08.471056"]]
UPDATE "participants" SET "wish_list" = $1, "updated_at" = $2 WHERE "participants"."id" = $3  [["wish_list", "PRESENTE presente1, presente2, presente3"], ["updated_at", "2015-12-25 00:45:02.856903"], ["id", 3]]

  def set_participant
    participant = get_participant_by_id_telegram(
        normalized_params[:participant_telegram_id],
        normalized_params[:id_chat]
      )

    if participant.present?
      participant.participating = true
    else
      participant = Participant.new
      participant.name = normalized_params[:participant_name]
      participant.participating = true
      participant.id_telegram = normalized_params[:participant_telegram_id]
      participant.secret_santa_event_id = get_event.id_chat
    end
    participant.save
---
INSERT INTO "participants" ("name", "participating", "id_telegram", "secret_santa_event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"